# Aadhar Enrollment Analysis

### Importing Libraries

In [1]:
import pandas as pd 
import warnings

## Loading Dataset

In [2]:
file_1 = pd.read_csv('api_data_aadhar_enrolment_0_500000.csv')
file_2 = pd.read_csv('api_data_aadhar_enrolment_500000_1000000.csv')
file_3 = pd.read_csv('api_data_aadhar_enrolment_1000000_1006029.csv')

In [3]:

print(file_1.columns.equals(file_2.columns))
print(file_2.columns.equals(file_3.columns))

True
True

In [4]:
# identifying mis-matches
set(file_1.columns) ^ set(file_2.columns)

set()

In [5]:
# concatenate the csv's
aadhar_raw = pd.concat(
    [file_1, file_2, file_3],
    axis=0,
    ignore_index=True
)

In [6]:
aadhar_raw.shape

(1006029, 7)

### Note:
The Aadhaar enrolment dataset was provided in multiple file partitions due to size constraints. All files were loaded using a consistent schema and concatenated vertically to reconstruct the complete dataset for analysis.

## Data Validation & Cleaning

In [7]:
aadhar_raw.duplicated().sum()

np.int64(22957)

In [8]:
total_rows = len(aadhar_raw)
dup_rows = aadhar_raw.duplicated().sum()

dup_rows, total_rows, dup_rows / total_rows

(np.int64(22957), 1006029, np.float64(0.022819421706531322))

In [9]:
dups = aadhar_raw[aadhar_raw.duplicated(keep=False)]
dups.head(10)

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
359389,13-10-2025,Punjab,Jalandhar,144041,2,1,0
359390,13-10-2025,Punjab,Jalandhar,144101,1,0,0
359391,13-10-2025,Punjab,Jalandhar,144102,2,0,0
359392,13-10-2025,Punjab,Jalandhar,144418,1,0,0
359393,13-10-2025,Punjab,Jalandhar,144419,1,0,0
359394,13-10-2025,Punjab,Jalandhar,144702,1,1,0
359395,13-10-2025,Punjab,Jalandhar,144801,0,1,0
359396,13-10-2025,Punjab,Kapurthala,144401,5,1,1
359397,13-10-2025,Punjab,Kapurthala,144601,4,2,2
359398,13-10-2025,Punjab,Kapurthala,144804,2,0,0

In [10]:
dups.groupby(dups.columns.tolist()).size().value_counts().head()

2    22957
Name: count, dtype: int64

In [11]:
# dropping duplicates
aadhar_clean = aadhar_raw.drop_duplicates()
aadhar_clean.shape

(983072, 7)

In [12]:
aadhar_clean.duplicated().sum()

np.int64(0)

### Note:
Post loading, the dataset was validated for schema consistency, data types, and exact duplicate records. Identified duplicates arising from file-level overlaps were removed to prevent artificial inflation of enrolment counts, ensuring analytical accuracy

## Feature Engineering

In [13]:
df = aadhar_clean
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
0,02-03-2025,Meghalaya,East Khasi Hills,793121,11,61,37
1,09-03-2025,Karnataka,Bengaluru Urban,560043,14,33,39
2,09-03-2025,Uttar Pradesh,Kanpur Nagar,208001,29,82,12
3,09-03-2025,Uttar Pradesh,Aligarh,202133,62,29,15
4,09-03-2025,Karnataka,Bengaluru Urban,560016,14,16,21

In [15]:
df.dtypes

date              object
state             object
district          object
pincode            int64
age_0_5            int64
age_5_17           int64
age_18_greater     int64
dtype: object

In [18]:
df = df.copy()
df['date'] = pd.to_datetime(df['date'], dayfirst=True)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 983072 entries, 0 to 1006028
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   date            983072 non-null  datetime64[ns]
 1   state           983072 non-null  object
 2   district        983072 non-null  object
 3   pincode         983072 non-null  int64
 4   age_0_5         983072 non-null  int64
 5   age_5_17        983072 non-null  int64
 6   age_18_greater  983072 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(2)
memory usage: 60.0+ MB

In [20]:
df['month'] = df['date'].dt.to_period('M')

In [22]:
df['total_enrollments'] = (
    df['age_0_5']
    + df['age_5_17']
    + df['age_18_greater']
)

In [25]:
df['share % 0-5'] = (
    df['age_0_5'] / df['total_enrollments']
)*100

In [27]:
df['share % 5-17'] = (
    df['age_5_17'] / df['total_enrollments']
)*100

In [29]:
df['share % 18+'] = (
    df['age_18_greater'] / df['total_enrollments']
)*100

In [37]:
df['highest_share'] = df[
    ['share % 0-5', 'share % 5-17', 'share % 18+']
].idxmax(axis=1)

In [38]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,month,total_enrollments,share % 0-5,share % 5-17,share % 18+,highest_share
0,2025-03-02,Meghalaya,East Khasi Hills,793121,11,61,37,2025-03,109,10.091743,55.963303,33.944954,share % 5-17
1,2025-03-09,Karnataka,Bengaluru Urban,560043,14,33,39,2025-03,86,16.279070,38.372093,45.348837,share % 18+
2,2025-03-09,Uttar Pradesh,Kanpur Nagar,208001,29,82,12,2025-03,123,23.577236,66.666667,9.756098,share % 5-17
3,2025-03-09,Uttar Pradesh,Aligarh,202133,62,29,15,2025-03,106,58.490566,27.358491,14.150943,share % 0-5
4,2025-03-09,Karnataka,Bengaluru Urban,560016,14,16,21,2025-03,51,27.450980,31.372549,41.176471,share % 18+

### Note:
   Feature engineering was performed to transform raw enrolment records into analytically meaningful variables by standardising temporal attributes, deriving demographic composition metrics, and identifying dominant age-group patterns at a granular geographic level.
   
   This phase established a structured, time-aware, and demographic-aware dataset, enabling robust univariate, bivariate, and trivariate analyses without introducing aggregation bias or interpretational ambiguity.

## Data Aggregation & Preparation for Analysis

#### I. District–Month Level Aggregation

In [39]:
district_month = df[
    ['state', 'district', 'month']
]

In [40]:
district_month = (
        df
    .groupby(['state', 'district', 'month'], as_index=False)
    .agg({
        'total_enrollments': 'sum',
        'age_0_5': 'sum',
        'age_5_17': 'sum',
        'age_18_greater': 'sum'
    })
)

In [44]:
district_month

,state,district,month,total_enrollments,age_0_5,age_5_17,age_18_greater
0,100000,100000,2025-09,12,0,0,12
1,100000,100000,2025-10,1,0,1,0
2,100000,100000,2025-11,11,0,0,11
3,100000,100000,2025-12,190,0,0,190
4,Andaman & Nicobar Islands,Andamans,2025-09,27,23,4,0
...,...,...,...,...,...,...,...
5057,Westbengal,Hooghly,2025-12,1,1,0,0
5058,andhra pradesh,chittoor,2025-09,1,1,0,0
5059,andhra pradesh,chittoor,2025-10,2,2,0,0
5060,andhra pradesh,chittoor,2025-12,1,1,0,0
5061,andhra pradesh,rangareddi,2025-09,1,1,0,0

### II. State-Month Level Aggregation

In [45]:
state_month = (
        df
    .groupby(['state','month'], as_index=False)
    .agg({
        'total_enrollments': 'sum',
        'age_0_5': 'sum',
        'age_5_17': 'sum',
        'age_18_greater': 'sum'
    })
)

In [46]:
state_month

,state,month,total_enrollments,age_0_5,age_5_17,age_18_greater
0,100000,2025-09,12,0,0,12
1,100000,2025-10,1,0,1,0
2,100000,2025-11,11,0,0,11
3,100000,2025-12,190,0,0,190
4,Andaman & Nicobar Islands,2025-09,43,39,4,0
...,...,...,...,...,...,...
318,Westbengal,2025-11,1,0,1,0
319,Westbengal,2025-12,1,1,0,0
320,andhra pradesh,2025-09,2,2,0,0
321,andhra pradesh,2025-10,2,2,0,0
322,andhra pradesh,2025-12,1,1,0,0

### Note:
The feature-engineered dataset was aggregated into structured analytical tables to support univariate, bivariate, and trivariate analysis. A district–month level table was created as the primary dataset to capture granular spatial and temporal patterns, while a state–month level table was derived as a secondary roll-up for contextual comparison across states.